CSI API ETABS v1
cFrameObj.SetSection Method
 Assigns a frame section property to a frame object.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetSection(
	string Name,
	string PropName,
	eItemType ItemType = eItemType.Objects,
	double SVarRelStartLoc = 0,
	double SVarTotalLength = 0
)
Function SetSection (
	Name As String,
	PropName As String,
	Optional ItemType As eItemType = eItemType.Objects,
	Optional SVarRelStartLoc As Double = 0,
	Optional SVarTotalLength As Double = 0
) As Integer
Dim instance As cFrameObj
Dim Name As String
Dim PropName As String
Dim ItemType As eItemType
Dim SVarRelStartLoc As Double
Dim SVarTotalLength As Double
Dim returnValue As Integer
returnValue = instance.SetSection(Name,
	PropName, ItemType, SVarRelStartLoc,
	SVarTotalLength)
int SetSection(
	String^ Name,
	String^ PropName,
	eItemType ItemType = eItemType::Objects,
	double SVarRelStartLoc = 0,
	double SVarTotalLength = 0
)
abstract SetSection :
        Name : string *
        PropName : string *
        ?ItemType : eItemType *
        ?SVarRelStartLoc : float *
        ?SVarTotalLength : float
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
        let _SVarRelStartLoc = defaultArg SVarRelStartLoc 0
        let _SVarTotalLength = defaultArg SVarTotalLength 0
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing frame object or group, depending on the value of the ItemType item.
PropName
Type: System.String
 This is None or the name of a frame section property to be assigned to the specified frame object(s).
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignment is made to the frame object specified by the Name item.
 If this item is Group, the assignment is made to all frame objects in the group specified by the Name item.
 If this item is SelectedObjects, the assignment is made to all selected frame objects and the Name item is ignored.
SVarRelStartLoc (Optional)
Type: System.Double
SVarTotalLength (Optional)
Type: System.Double
Return Value
Type: Int32
 Returns zero if the frame section property data is successfully assigned, otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'create new concrete frame section property
   ret = SapModel.PropFrame.SetRectangle("R1", "4000Psi", 20, 12)
'set frame section property
   ret = SapModel.FrameObj.SetSection("8", "R1")
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cFrameObj Interface
ETABSv1 Namespace